#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ----------------------------------------------------------------------------------------------------------------------
# @Time    : 2023/11/15 0:14
# @Author  : huangfujue
# @File    : 庙旺利陷表.py
# @Date    : 2023/11/15 
"""
表示不同星辰在不同的宫中的亮度
→  庙
　　星最明，得数最强，吉星极吉，凶星不凶。
→  旺：
　　星次明，得数次强，吉星吉，凶星不凶。
→  得
　　又叫得地：星光明，得数适度，吉星仍吉，凶星不凶。
→  利
　　又叫利益：星尚明，得数渐弱，吉星尚吉，凶星渐凶。
→  平
　　又叫和平：星光已低，得数已弱，吉易力微，凶星肆凶。
→  不
　　又叫不得地：星光已暗，得数最弱，吉星无力，凶星愈凶。
→  陷：
　　陷，又叫落陷：星无光，无数可得，吉星无用，凶星最凶。

"""
# ----------------------------------------------------------------------------------------------------------------------
# TODO
"""
在丑宫的天机星，不知道是落陷还是入庙，这里先按落陷处理
"""
liang_du_biao = {
    "子": {
        "天机": "庙",
        "天府": "庙",
        "太阴": "庙",
        "天相": "庙",
        "天梁": "庙",
        "破军": "庙",
        "禄存": "庙",
        "武曲": "旺",
        "天同": "旺",
        "贪狼": "旺",
        "巨门": "旺",
        "七杀": "旺",
        "文昌": "得",
        "文曲": "得",
        "紫薇": "平",
        "廉贞": "平",
        "太阳": "陷",
        "擎羊": "陷",
        "火星": "陷",
        "铃星": "陷",
    },
    "丑": {
        "紫薇": "庙",
        "武曲": "庙",
        "天府": "庙",
        "太阴": "庙",
        "贪狼": "庙",
        "天相": "庙",
        "七杀": "庙",
        "文昌": "庙",
        "文曲": "庙",
        "擎羊": "庙",
        "陀螺": "庙",
        "天梁": "旺",
        "破军": "旺",
        "火星": "得",
        "铃星": "得",
        "廉贞": "利",
        "太阳": "不",
        "天同": "不",
        "巨门": "不",
        "天机": "陷",
    },
    "寅": {
        "廉贞": "庙",
        "天府": "庙",
        "巨门": "庙",
        "天相": "庙",
        "天梁": "庙",
        "七杀": "庙",
        "禄存": "庙",
        "火星": "庙",
        "铃星": "庙",
        "紫薇": "旺",
        "太阳": "旺",
        "太阴": "旺",
        "天机": "得",
        "武曲": "得",
        "破军": "得",
        "天同": "利",
        "贪狼": "平",
        "文曲": "平",
        "文昌": "陷",
        "陀螺": "陷",
    },
    "卯": {
        "太阳": "庙",
        "巨门": "庙",
        "天梁": "庙",
        "禄存": "庙",
        "紫薇": "旺",
        "天机": "旺",
        "七杀": "旺",
        "文曲": "旺",
        "天府": "得",
        "武曲": "利",
        "贪狼": "利",
        "文昌": "利",
        "火星": "利",
        "铃星": "利",
        "天同": "平",
        "廉贞": "平",
        "太阴": "陷",
        "天相": "陷",
        "破军": "陷",
        "擎羊": "陷",
    },
    "辰": {
        "武曲": "庙",
        "天府": "庙",
        "贪狼": "庙",
        "天梁": "庙",
        "七杀": "庙",
        "擎羊": "庙",
        "陀螺": "庙",
        "太阳": "旺",
        "破军": "旺",
        "紫薇": "得",
        "天相": "得",
        "文昌": "得",
        "文曲": "得",
        "天机": "利",
        "廉贞": "利",
        "天同": "平",
        "太阴": "陷",
        "巨门": "陷",
        "火星": "陷",
        "铃星": "陷",
    },
    "巳": {
        "天同": "庙",
        "文昌": "庙",
        "文曲": "庙",
        "禄存": "庙",
        "紫薇": "旺",
        "太阳": "旺",
        "巨门": "旺",
        "天府": "得",
        "天相": "得",
        "火星": "得",
        "铃星": "得",
        "天机": "平",
        "武曲": "平",
        "七杀": "平",
        "破军": "平",
        "廉贞": "陷",
        "太阴": "陷",
        "贪狼": "陷",
        "天梁": "陷",
        "陀螺": "陷",
    },
    "午": {},
    "未": {},
    "申": {},
    "酉": {},
    "戌": {},
    "亥": {},
}

"""


"""


class Liang_Du:
    def __init__(self, xing, gong):
        pass
