#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ----------------------------------------------------------------------------------------------------------------------
# @Time    : 2023/11/13 19:17
# @Author  : huangfujue
# @File    : 时系诸星表.py
# @Date    : 2023/11/13 
"""
根据出生的时辰和出生年支确定以下这些星在哪个宫
火星、铃星

根据出生时辰直接确定乙级的星在哪个宫
文昌、文曲
地空、地劫
台辅，封诰
"""
# ----------------------------------------------------------------------------------------------------------------------
# 根据年支和出生时辰确定的甲级星 火星、铃星
# 先本生年支，再取对应的星辰，再安出生时辰取值得到该星对应的宫

huo_ling_xing_biao = {
    "寅": {
        "火星": {
            "子": "丑",
            "丑": "寅",
            "寅": "卯",
            "卯": "辰",
            "辰": "巳",
            "巳": "午",
            "午": "未",
            "未": "申",
            "申": "酉",
            "酉": "戌",
            "戌": "亥",
            "亥": "子"},
        "铃星": {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"},
    },
    "午": {
        "火星": {
            "子": "丑",
            "丑": "寅",
            "寅": "卯",
            "卯": "辰",
            "辰": "巳",
            "巳": "午",
            "午": "未",
            "未": "申",
            "申": "酉",
            "酉": "戌",
            "戌": "亥",
            "亥": "子"},
        "铃星": {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"},
    },
    "戌": {
        "火星": {
            "子": "丑",
            "丑": "寅",
            "寅": "卯",
            "卯": "辰",
            "辰": "巳",
            "巳": "午",
            "午": "未",
            "未": "申",
            "申": "酉",
            "酉": "戌",
            "戌": "亥",
            "亥": "子"},
        "铃星": {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"},
    },
    "申": {
        "火星": {
            "子": "寅",
            "丑": "卯",
            "寅": "辰",
            "卯": "巳",
            "辰": "午",
            "巳": "未",
            "午": "申",
            "未": "酉",
            "申": "戌",
            "酉": "亥",
            "戌": "子",
            "亥": "丑"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "子": {
        "火星": {
            "子": "寅",
            "丑": "卯",
            "寅": "辰",
            "卯": "巳",
            "辰": "午",
            "巳": "未",
            "午": "申",
            "未": "酉",
            "申": "戌",
            "酉": "亥",
            "戌": "子",
            "亥": "丑"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "辰": {
        "火星": {
            "子": "寅",
            "丑": "卯",
            "寅": "辰",
            "卯": "巳",
            "辰": "午",
            "巳": "未",
            "午": "申",
            "未": "酉",
            "申": "戌",
            "酉": "亥",
            "戌": "子",
            "亥": "丑"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "巳": {
        "火星": {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "酉": {
        "火星": {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "丑": {
        "火星": {
            "子": "卯",
            "丑": "辰",
            "寅": "巳",
            "卯": "午",
            "辰": "未",
            "巳": "申",
            "午": "酉",
            "未": "戌",
            "申": "亥",
            "酉": "子",
            "戌": "丑",
            "亥": "寅"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "亥": {
        "火星": {
            "子": "酉",
            "丑": "戌",
            "寅": "亥",
            "卯": "子",
            "辰": "丑",
            "巳": "寅",
            "午": "卯",
            "未": "辰",
            "申": "巳",
            "酉": "午",
            "戌": "未",
            "亥": "申"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "卯": {
        "火星": {
            "子": "酉",
            "丑": "戌",
            "寅": "亥",
            "卯": "子",
            "辰": "丑",
            "巳": "寅",
            "午": "卯",
            "未": "辰",
            "申": "巳",
            "酉": "午",
            "戌": "未",
            "亥": "申"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
    "未": {
        "火星": {
            "子": "酉",
            "丑": "戌",
            "寅": "亥",
            "卯": "子",
            "辰": "丑",
            "巳": "寅",
            "午": "卯",
            "未": "辰",
            "申": "巳",
            "酉": "午",
            "戌": "未",
            "亥": "申"},
        "铃星": {
            "子": "戌",
            "丑": "亥",
            "寅": "子",
            "卯": "丑",
            "辰": "寅",
            "巳": "卯",
            "午": "辰",
            "未": "巳",
            "申": "午",
            "酉": "未",
            "戌": "申",
            "亥": "酉"},
    },
}

# 根据出生时辰确定的星耀
shi_chen_xing_biao = {
    "文昌": {
        "子": "戌",
        "丑": "酉",
        "寅": "申",
        "卯": "未",
        "辰": "午",
        "巳": "巳",
        "午": "辰",
        "未": "卯",
        "申": "寅",
        "酉": "丑",
        "戌": "子",
        "亥": "亥"
    },
    "文曲": {
        "子": "辰",
        "丑": "巳",
        "寅": "午",
        "卯": "未",
        "辰": "申",
        "巳": "酉",
        "午": "戌",
        "未": "亥",
        "申": "子",
        "酉": "丑",
        "戌": "寅",
        "亥": "卯"
    },
    "地劫": {
        "子": "亥",
        "丑": "子",
        "寅": "丑",
        "卯": "寅",
        "辰": "卯",
        "巳": "辰",
        "午": "巳",
        "未": "午",
        "申": "未",
        "酉": "申",
        "戌": "酉",
        "亥": "戌"
    },
    "地空": {
        "子": "亥",
        "丑": "戌",
        "寅": "酉",
        "卯": "申",
        "辰": "未",
        "巳": "午",
        "午": "巳",
        "未": "辰",
        "申": "卯",
        "酉": "寅",
        "戌": "丑",
        "亥": "子"
    },
    "台辅": {
        "子": "午",
        "丑": "未",
        "寅": "申",
        "卯": "酉",
        "辰": "戌",
        "巳": "亥",
        "午": "子",
        "未": "丑",
        "申": "寅",
        "酉": "卯",
        "戌": "辰",
        "亥": "巳"
    },
    "封诰": {
        "子": "寅",
        "丑": "卯",
        "寅": "辰",
        "卯": "巳",
        "辰": "午",
        "巳": "未",
        "午": "申",
        "未": "酉",
        "申": "戌",
        "酉": "亥",
        "戌": "子",
        "亥": "丑"
    }
}

#

if __name__ == '__main__':
    # 先取年支，再取星耀，再取出生时辰
    for nian_zhi in ["寅",
                     "申",
                     "巳",
                     "亥",
                     ]:
        print(nian_zhi)
        for start in ["火星", "铃星"]:
            d = huo_ling_xing_biao.get(nian_zhi).get(start)
            print(start, f"{d.get('子')} {d.get('丑')} {d.get('寅')} {d.get('卯')} {d.get('辰')} "
                         f"{d.get('巳')} {d.get('午')} {d.get('未')} {d.get('申')} {d.get('酉')} {d.get('戌')} {d.get('亥')} ")

    # 直接根据出生时辰确定的星耀
    print("=="*20)

    for start in shi_chen_xing_biao.keys():
        d=shi_chen_xing_biao.get(start)
        print(start, f"{d.get('子')} {d.get('丑')} {d.get('寅')} {d.get('卯')} {d.get('辰')} "
                     f"{d.get('巳')} {d.get('午')} {d.get('未')} {d.get('申')} {d.get('酉')} {d.get('戌')} {d.get('亥')} ")


