#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ----------------------------------------------------------------------------------------------------------------------
# @Time    : 2023/11/15 11:43
# @Author  : huangfujue
# @File    : 星辰表.py
# @Date    : 2023/11/15 
"""
表示所有用到得星辰
"""
# ----------------------------------------------------------------------------------------------------------------------
# TODO
"""
描述诸星分属南北斗五行并化吉凶信息的类
缺少天厨,先补上
缺少天空,先补上
缺少月德星,先补上
缺少空亡星，没补上，因为不知道在哪里
"""


class Star_Info:
    def __init__(self, level=5, name="", dou_fen="", zhu_hua="", wuxing_list=[]):
        """
        :param level: 星辰等级(1-4)
        :param name: 名称
        :param dou_fen: 属于南北斗的信息，不属于是空字符串
        :param zhu_hua: 这个星辰主的是什么，化的是什么
        :param wuxing_list: 五行所属列表，允许空列表，但不要不传参
        """
        self.level = level
        self.name = name
        self.wuxing_list = wuxing_list
        self.dou_fen = dou_fen
        self.zhu_hua = zhu_hua


star_info = {
    "紫薇": Star_Info(1, "紫薇", "南北", "尊", ["土"]),
    "天机": Star_Info(1, "天机", "南三", "善", ["木"]),
    "太阳": Star_Info(1, "太阳", "南北", "贵", ["火"]),
    "武曲": Star_Info(1, "武曲", "北六", "财", ["金"]),
    "天同": Star_Info(1, "天同", "南四", "福", ["水"]),
    "廉贞": Star_Info(1, "廉贞", "北五", "囚", ["木", "火"]),
    "天府": Star_Info(1, "天府", "南一", "贤能", ["土"]),
    "太阴": Star_Info(1, "太阴", "南北", "富", ["水"]),
    "贪狼": Star_Info(1, "贪狼", "北一", "桃花", ["水", "木"]),
    "巨门": Star_Info(1, "巨门", "北二", "暗", ["水"]),
    "天相": Star_Info(1, "天相", "南五", "印", ["水"]),
    "天梁": Star_Info(1, "天梁", "南二", "阴", ["土"]),
    "七杀": Star_Info(1, "七杀", "南六", "将星", ["火", "金"]),
    "破军": Star_Info(1, "破军", "北七", "耗", ["水"]),
    "文昌": Star_Info(1, "文昌", "南北", "科甲", ["金"]),
    "文曲": Star_Info(1, "文曲", "北四", "科甲", ["水"]),
    "左辅": Star_Info(1, "左辅", "南北", "助力", ["土"]),
    "右弼": Star_Info(1, "右弼", "南北", "助力", ["水"]),

    "天魁": Star_Info(1, "天魁", "    ", "阳贵", ["火"]),
    "天钺": Star_Info(1, "天钺", "    ", "阴贵", ["火"]),
    "禄存": Star_Info(1, "禄存", "北三", "爵禄", ["土"]),
    "擎羊": Star_Info(1, "擎羊", "北助", "刑", ["火", "金"]),
    "陀罗": Star_Info(1, "陀罗", "北助", "忌", ["金"]),
    "火星": Star_Info(1, "火星", "南助", "杀", ["火"]),
    "铃星": Star_Info(1, "铃星", "南助", "杀", ["火"]),
    "地劫": Star_Info(2, "地劫", "    ", "多灾", ["火"]),
    "地空": Star_Info(2, "地空", "    ", "失", ["火"]),
    "天马": Star_Info(2, "天马", "    ", "主动", ["火"]),
    "化禄": Star_Info(1, "化禄", "    ", "财禄", ["土"]),
    "化权": Star_Info(1, "化权", "    ", "权势", ["木"]),
    "化科": Star_Info(1, "化科", "    ", "声名", ["水"]),
    "化忌": Star_Info(1, "化忌", "    ", "多咎", ["水"]),
    "台辅": Star_Info(2, "台辅", "    ", "主贵", ["土"]),
    "封诰": Star_Info(2, "封诰", "    ", "主贵", ["土"]),
    "天刑": Star_Info(2, "天刑", "    ", "孤克", ["火"]),
    "天姚": Star_Info(2, "天姚", "    ", "风流", ["水"]),

    "天巫": Star_Info(2, "天巫", "    ", "升迁", []),
    "天月": Star_Info(2, "天月", "    ", "主病", []),
    "阴煞": Star_Info(2, "阴煞", "    ", "主有小人", []),
    "三台": Star_Info(2, "三台", "    ", "主贵", ["土"]),
    "八座": Star_Info(2, "八座", "    ", "主贵", ["土"]),
    "恩光": Star_Info(2, "恩光", "    ", "主受殊恩", ["火"]),
    "天贵": Star_Info(2, "天贵", "    ", "主贵", ["土"]),
    "天官": Star_Info(2, "天官", "    ", "贵显", ["土"]),
    "天福": Star_Info(2, "天福", "    ", "爵禄", ["土"]),
    "解神": Star_Info(2, "解神", "    ", "解灾", []),
    "博士": Star_Info(3, "博士", "    ", "聪明", ["水"]),
    "力士": Star_Info(3, "力士", "    ", "权势", ["火"]),
    "青龙": Star_Info(3, "青龙", "    ", "喜气", ["水"]),
    "小耗": Star_Info(3, "小耗", "    ", "耗财、小败", ["火"]),
    "将军": Star_Info(3, "将军", "    ", "威猛", ["木"]),
    "奏书": Star_Info(3, "奏书", "    ", "福禄", ["金"]),
    "飞廉": Star_Info(3, "飞廉", "    ", "孤克", ["火"]),
    "喜神": Star_Info(3, "喜神", "    ", "吉庆", ["火"]),

    "病符": Star_Info(3, "病符", "    ", "主灾病", ["水"]),
    "大耗": Star_Info(3, "大耗", "    ", "退祖、破财、大败", ["火"]),
    "伏兵": Star_Info(3, "伏兵", "    ", "口舌、是非", ["火"]),
    "官府": Star_Info(3, "官府", "    ", "口舌、刑仗", ["火"]),
    "天哭": Star_Info(2, "天哭", "    ", "主忧伤", ["金"]),
    "天虚": Star_Info(2, "天虚", "    ", "主忧伤", ["土"]),
    "龙池": Star_Info(2, "龙池", "    ", "主科甲", ["水"]),
    "凤阁": Star_Info(2, "凤阁", "    ", "主科甲", ["土"]),
    "红鸾": Star_Info(2, "红鸾", "    ", "主婚姻", ["水"]),
    "天喜": Star_Info(2, "天喜", "    ", "主喜庆", ["水"]),
    "孤辰": Star_Info(2, "孤辰", "    ", "主孤", ["火"]),
    "寡宿": Star_Info(2, "寡宿", "    ", "主寡", ["火"]),
    "蜚廉": Star_Info(2, "蜚廉", "    ", "主孤克", ["火"]),
    "破碎": Star_Info(2, "破碎", "    ", "主损耗", ["火"]),
    "天才": Star_Info(2, "天才", "    ", "主才能", ["木"]),

    "天寿": Star_Info(2, "天寿", "    ", "主有寿", ["土"]),
    "截空": Star_Info(3, "截空", "    ", "诸空", []),
    "旬空": Star_Info(3, "旬空", "    ", "诸空", []),

    "天伤": Star_Info(3, "天伤", "    ", "虚耗", ["水"]),
    "天使": Star_Info(3, "天使", "    ", "灾祸", ["水"]),
    "长生": Star_Info(3, "长生", "    ", "主生发", []),
    "沐浴": Star_Info(3, "沐浴", "    ", "主桃花", []),
    "冠带": Star_Info(3, "冠带", "    ", "主喜庆", []),
    "临官": Star_Info(3, "临官", "    ", "主喜庆", []),
    "帝旺": Star_Info(3, "帝旺", "    ", "旺壮", []),
    "衰": Star_Info(3, "衰", "    ", "颓败", []),
    "病": Star_Info(3, "病", "    ", "疾病", []),
    "死": Star_Info(3, "死", "    ", "丧亡", []),
    "墓": Star_Info(3, "墓", "    ", "钦藏", []),
    "绝": Star_Info(3, "绝", "    ", "绝灭", []),
    "胎": Star_Info(3, "胎", "    ", "主喜", []),
    "养": Star_Info(3, "养", "    ", "主福", []),
    # 之后德这些看不到等级德星统统按第五等级处理
    "将星": Star_Info(5, "将星", "    ", "化凶为吉", []),
    "攀鞍": Star_Info(5, "攀鞍", "    ", "利功名", []),
    "岁驿": Star_Info(5, "岁驿", "    ", "利迁动", []),
    "息神": Star_Info(5, "息神", "    ", "消沉", []),

    "华盖": Star_Info(5, "华盖", "    ", "孤高", ["木"]),
    "劫煞": Star_Info(5, "劫煞", "    ", "窍盗", ["火"]),
    "灾煞": Star_Info(5, "灾煞", "    ", "灾患", []),
    "天煞": Star_Info(5, "天煞", "    ", "克父、克夫", []),
    "指背": Star_Info(5, "指背", "    ", "诽谤", []),
    "咸池": Star_Info(5, "咸池", "    ", "桃花", []),
    "月煞": Star_Info(5, "月煞", "    ", "克母、克妻", []),
    "亡神": Star_Info(5, "亡神", "    ", "耗败", []),
    "岁建": Star_Info(5, "岁建", "    ", "一年休咎", ["火"]),
    "晦气": Star_Info(5, "晦气", "    ", "主咎", []),
    "丧门": Star_Info(5, "丧门", "    ", "丧亡", ["木"]),
    "贯索": Star_Info(5, "贯索", "    ", "狱灾", []),
    "官符": Star_Info(5, "官符", "    ", "主讼", ["火"]),
    # "小耗": Star_Inf5,"("小耗", "    ", "小失", ["火"]),    # 重复了，内容在上补充
    # "大耗": Star_Inf5,"("大耗", "    ", "大败", ["火"]),    # 重复了，内容在上补充
    "龙德": Star_Info(5, "龙德", "    ", "化凶为吉", []),
    "白虎": Star_Info(5, "白虎", "    ", "诸凶", ["金"]),
    "天德": Star_Info(5, "天德", "    ", "化凶为吉", []),
    "串客": Star_Info(5, "串客", "    ", "孝服", ["火"]),
    # "病符": Star_Info("病符", "    ", "疾厄", []), # 重复了
    "天厨": Star_Info(2, "天厨", "    ", "缺少天厨星", []),
    "月德": Star_Info(2, "月德", "    ", "缺少月德星", ["木"]),
    "天空": Star_Info(2, "天空", "    ", "缺少天空星", []),
}

if __name__ == '__main__':
    print(len(star_info))
