#!/usr/bin/env python
# -*- coding: utf-8 -*-
# ----------------------------------------------------------------------------------------------------------------------
# @Time    : 2023/11/13 11:56
# @Author  : huangfujue
# @File    : qi_zi_wei_biao_module.py
# @Date    : 2023/11/13 
"""
模块说明
"""
# ----------------------------------------------------------------------------------------------------------------------

# 需要注意紫微表现在使用的键是数字，而json中使用的是字符串
import json
import os

from tianji.config.json_module import zi_wei_biao
from tianji.proj_config import my_dir



# zi_wei_biao = {
#     1: {
#         "水二局": "丑",
#         "木三局": "辰",
#         "金四局": "亥",
#         "土五局": "午",
#         "火六局": "酉"},
#     2: {
#         "水二局": "寅",
#         "木三局": "丑",
#         "金四局": "辰",
#         "土五局": "亥",
#         "火六局": "午"},
#     3: {
#         "水二局": "寅",
#         "木三局": "寅",
#         "金四局": "丑",
#         "土五局": "辰",
#         "火六局": "亥"},
#     4: {
#         "水二局": "卯",
#         "木三局": "巳",
#         "金四局": "寅",
#         "土五局": "丑",
#         "火六局": "辰"},
#     5: {
#         "水二局": "卯",
#         "木三局": "寅",
#         "金四局": "子",
#         "土五局": "寅",
#         "火六局": "丑"},
#     6: {
#         "水二局": "辰",
#         "木三局": "卯",
#         "金四局": "巳",
#         "土五局": "未",
#         "火六局": "寅"},
#     7: {
#         "水二局": "辰",
#         "木三局": "午",
#         "金四局": "寅",
#         "土五局": "子",
#         "火六局": "戌"},
#     8: {
#         "水二局": "巳",
#         "木三局": "卯",
#         "金四局": "卯",
#         "土五局": "巳",
#         "火六局": "未"},
#     9: {
#         "水二局": "巳",
#         "木三局": "辰",
#         "金四局": "丑",
#         "土五局": "寅",
#         "火六局": "子"},
#     10: {
#         "水二局": "午",
#         "木三局": "未",
#         "金四局": "午",
#         "土五局": "卯",
#         "火六局": "巳"},
#     11: {
#         "水二局": "午",
#         "木三局": "辰",
#         "金四局": "卯",
#         "土五局": "申",
#         "火六局": "寅"},
#     12: {
#         "水二局": "未",
#         "木三局": "巳",
#         "金四局": "辰",
#         "土五局": "丑",
#         "火六局": "卯"},
#     13: {
#         "水二局": "未",
#         "木三局": "申",
#         "金四局": "寅",
#         "土五局": "午",
#         "火六局": "亥"},
#     14: {
#         "水二局": "申",
#         "木三局": "巳",
#         "金四局": "未",
#         "土五局": "卯",
#         "火六局": "申"},
#     15: {
#         "水二局": "申",
#         "木三局": "午",
#         "金四局": "辰",
#         "土五局": "辰",
#         "火六局": "丑"},
#     16: {
#         "水二局": "酉",
#         "木三局": "酉",
#         "金四局": "巳",
#         "土五局": "酉",
#         "火六局": "午"},
#     17: {
#         "水二局": "酉",
#         "木三局": "午",
#         "金四局": "卯",
#         "土五局": "寅",
#         "火六局": "卯"},
#     18: {
#         "水二局": "戌",
#         "木三局": "未",
#         "金四局": "申",
#         "土五局": "未",
#         "火六局": "辰"},
#     19: {
#         "水二局": "戌",
#         "木三局": "戌",
#         "金四局": "巳",
#         "土五局": "辰",
#         "火六局": "子"},
#     20: {
#         "水二局": "亥",
#         "木三局": "未",
#         "金四局": "午",
#         "土五局": "巳",
#         "火六局": "酉"},
#     21: {
#         "水二局": "亥",
#         "木三局": "申",
#         "金四局": "辰",
#         "土五局": "戌",
#         "火六局": "寅"},
#     22: {
#         "水二局": "子",
#         "木三局": "亥",
#         "金四局": "酉",
#         "土五局": "卯",
#         "火六局": "未"},
#     23: {
#         "水二局": "子",
#         "木三局": "申",
#         "金四局": "午",
#         "土五局": "申",
#         "火六局": "辰"},
#     24: {
#         "水二局": "丑",
#         "木三局": "酉",
#         "金四局": "未",
#         "土五局": "巳",
#         "火六局": "巳"},
#     25: {
#         "水二局": "丑",
#         "木三局": "子",
#         "金四局": "巳",
#         "土五局": "午",
#         "火六局": "丑"},
#     26: {
#         "水二局": "寅",
#         "木三局": "酉",
#         "金四局": "戌",
#         "土五局": "亥",
#         "火六局": "戌"},
#     27: {
#         "水二局": "寅",
#         "木三局": "戌",
#         "金四局": "未",
#         "土五局": "辰",
#         "火六局": "卯"},
#     28: {
#         "水二局": "卯",
#         "木三局": "丑",
#         "金四局": "申",
#         "土五局": "酉",
#         "火六局": "申"},
#     29: {
#         "水二局": "卯",
#         "木三局": "戌",
#         "金四局": "午",
#         "土五局": "午",
#         "火六局": "巳"},
#     30: {
#         "水二局": "辰",
#         "木三局": "亥",
#         "金四局": "亥",
#         "土五局": "未",
#         "火六局": "午"},
# }
if __name__ == '__main__':
    from tianji.config.zi_wei_dou_shu.wu_xing_jv_biao_module import wu_xing_list

    for i in range(1, 31):
        sheng_ri = str(i)
        print("=====" * 15, "\n生日：{}".format(sheng_ri))
        for wuxingjv in wu_xing_list.values():
            print("\n", wuxingjv, zi_wei_biao.get(sheng_ri).get(wuxingjv))
